app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_params)
        if comment.save
            post = Post.find(params[:post_id])
---
INSERT INTO "comments" ("content", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "123r"], ["post_id", 11], ["created_at", "2021-02-17 19:47:15.339877"], ["updated_at", "2021-02-17 19:47:15.339877"]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]