app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
    def index
        render json: Post.all.map {|post| PostSerializer.new(post)}

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "ffwefw"], ["created_at", "2021-02-17 13:44:52.337573"], ["updated_at", "2021-02-17 13:44:52.337573"]]
SELECT "posts".* FROM "posts"
---
	def create
        post = Post.new(post_params)
        if post.save
	        render json: Post.all.map {|post| PostSerializer.new(post)}

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
SELECT "posts".* FROM "posts"
---
    def destroy
        post = Post.find(params[:id])
        post.destroy
        render json: Post.all.map {|post| PostSerializer.new(post)}

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 29], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "post updated"], ["updated_at", "2021-03-18 17:13:48.428912"], ["id", 29]]
SELECT "posts".* FROM "posts"
---
    def update
        post = Post.find(params[:id])
        post.content = params[:content]
        post.save
        render json: Post.all.map {|post| PostSerializer.new(post)}

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
---
    def getOne
        post = Post.find(params[:id])